Open-CMSIS-Pack/pack-examples/STM32U5xx_DFP/Keil.STM32U5xx_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.7.36" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="https://raw.githubusercontent.com/Open-CMSIS-Pack/Open-CMSIS-Pack-Spec/v1.7.36/schema/PACK.xsd">
  <vendor>Keil</vendor>
  <name>STM32U5xx_DFP</name>
  <description>STMicroelectronics STM32U5 Series Device Support</description>
  <url>https://www.keil.com/pack/</url>
  <license>LICENSE</license>
  <licenseSets>
    <licenseSet id="all" default="true" gating="true">
      <license name="LICENSE" title="Apache 2.0 open-source license" spdx="Apache-2.0"/>
    </licenseSet>
  </licenseSets>

  <releases>
    <release version="3.0.0-dev0">
      Remove STM32CubeMX_FW_U5
      Remove previous generator (gpdsc)
      Add new global generator
      Package Description (pdsc):
      - Remove Device:Startup component
      - Remove Device:STM32Cube HAL components
      - Remove Device:STM32Cube LL components
      - Remove compile device header from device description
      - Remove not used conditions
    </release>
    <release version="2.2.2-dev0">
      CMSIS Device:
      - Updated SVD files.
    </release>
    <release version="2.2.1" date="2024-02-22">
      STM32CubeMX integration:
      - Corrected UCPD peripheral handling in FrameworkCubeMX_gpdsc.ftl
    </release>
    <release version="2.2.0" date="2023-11-24">
      Devices Support:
      - Updated STM32Cube_FW_U5 Firmware Package version to V1.3.0 (HAL v1.3.0)
      - Added STM32U5F9/G9, STM32U5F7/G7 device support
      - Updated SVD Files for all devices
      - Updated SRAM2 for the STM32U5 4MB devices
      - Renamed OSPI loader for the STM32U5 4MB
      - Updated GCC startup files (fixed improperly closed comments)
      - Updated GCC linker script files
      - Corrected linker script file header
      STM32CubeMX integration:
      - Added Component Subgroups DSI, GFXMMU, GFXTIM, GPU2D, JPEG, LTDC, XSPI
      - Updated GPDSC FTL file
      CMSIS-Driver:
      - I2C:
      -- Updated PowerControl function (added check if Instance is valid)
      -- Updated Control function implementation for transfer abort (added check for master mode)
      -- Minor cleanup (removed unused extern declarations from header file)
      - USB Device:
      -- Updated PowerControl function (removed unnecessary NVIC handling and added check if Instance is valid)
      - USB Host:
      -- Updated PowerControl function (removed unnecessary NVIC handling)
    </release>
    <release version="2.1.0" date="2023-03-15">
      Devices Support:
      - Updated STM32Cube_FW_U5 Firmware Package version to V1.2.0 (HAL v1.2.0)
      - Added STM32U595/A5, STM32U599/A9 device support
      - Added STM32U535/45 device support
      - Added C-Startup variant
      - Updated SVD files
      - Updated Flash programming algorithms
      - Updated STM32U5 Datasheets
      - Renamed DBGCONF file
      Pack Description:
      - Reworked conditions
      - Removed HAL dependency for component ::Device:Startup
      STM32CubeMX integration:
      - MX_Device.h: Generated definitions for GPIO Pins with assigned labels
      CMSIS-Driver:
      - Updated documentation
      - Added I2C driver
      - Added MCI driver
      - Added USB Host and USB Device drivers
      - SPI:
      -- Updated Receive function to properly support Default Tx Value transmission during reception
         (due to STM32 HAL changed functionality)
      -- Corrected Control function to support more than 8 data bits in DMA mode
      -- Corrected GetDataCount function in DMA mode
      - USART:
      -- Corrected GetStatus function and status flags handling
      -- Corrected Control function to support 9 data bits in DMA mode
      -- Corrected GetTxCount and GetRxCount functions in DMA mode
      -- Removed Rx Timeout capability and event signalization
    </release>
    <release version="2.0.0" date="2022-05-30">
      STM32CubeMX integration:
      - New workflow concept (incompatible with earlier STM32U5xx_DFPs)
      - Automatic migration of projects, with disabled TrustZone, that were created with earlier STM32U5xx_DFPs
      - Added STM32CubeMX integration for TrustZone enabled devices
      - STM32CubeMX can be started with a default configuration for selected board
    </release>
    <release version="1.2.0" date="2022-03-25">
      Updated Pack to STM32Cube_FW_U5 Firmware Package version V1.1.0
      Updated reference manual, datasheets
      Corrected partition files
    </release>
    <release version="1.1.1" date="2022-02-01">
      Updated Pack to STM32Cube_FW_U5 Firmware Package version V1.0.2:
      - Add support for STM32U585I-IOT02A OSPI external Loader
      Devices Support:
      - Removed 'Q' devices
      - Updated SVD file
      Package Description (pdsc):
      - Updated schemaVersion (1.7.2)
      - Added RAMstart and RAMsize attributes to Flash Algorithm elements
      CMSIS Driver:
      - Added UART/USART CMSIS driver
      - Added SPI CMSIS driver
    </release>
    <release version="1.1.0" date="2021-07-23">
      Updated STM32Cube Firmware U5 library to version V1.0.0
      - First official release of HAL and LL drivers for STM32U575xx/STM32U585xx devices
    </release>
  </releases>

  <keywords>
    <keyword>ST</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package STMicroelectronics</keyword>
    <keyword>STM32U5</keyword>
    <keyword>STM32U5xx</keyword>
  </keywords>

  <devices>
    <family Dfamily="STM32U5 Series" Dvendor="STMicroelectronics:13">
      <processor Dcore="Cortex-M33" DcoreVersion="r0p0" Dfpu="SP_FPU" Dmpu="MPU" Ddsp="DSP" Dtz="TZ" Dendian="Little-endian" Dclock="160000000"/>
      <description>
The STM32U5 series offers advanced power-saving microcontrollers, based on Arm® Cortex®-M33 to meet the most demanding power/performance requirements for smart applications, including wearables, personal medical devices, home automation, and industrial sensors.
Offering up to 2 Mbytes of Flash (dual bank) memory and 786 Kbytes of SRAM, the STM32U5 series of microcontrollers takes performance to the next level.
      </description>

      <book name="Documentation/arm_cortex_m33_dgug_100235_0004_00_en.pdf"  title="Arm Cortex-M33 Devices"/>
      <book name="Documentation/RM0456.pdf" title="STM32U575/585 Arm-based 32-bit MCUs Reference Manual"/>

      <algorithm name="CMSIS/Flash/MX25LM51245G_STM32U575I-EVAL.FLM"    start="0x70000000" size="0x04000000" RAMstart="0x20000000" RAMsize="0xA0000" default="0" />
      <algorithm name="CMSIS/Flash/MX25LM51245G_STM32U585I_IOT02A.FLM"  start="0x70000000" size="0x04000000" RAMstart="0x20000000" RAMsize="0xA0000" default="0" />
      <algorithm name="CMSIS/Flash/MX25LM51245G_STM32U599J-DK.FLM"      start="0x90000000" size="0x04000000" RAMstart="0x20000000" RAMsize="0xFFF4"  default="0" />

      <debugvars configfile="CMSIS/Debug/STM32U535_545_575_585_59x_5Ax.dbgconf" version="1.0.0">
        __var DbgMCU_CR       = 0x00000006;   // DBGMCU_CR: DBG_STOP, DBG_STANDBY
        __var DbgMCU_APB1L_Fz = 0x00000000;   // DGBMCU_APB1L_FZ: All Peripherals Operate as in Normal Mode
        __var DbgMCU_APB1H_Fz = 0x00000000;   // DGBMCU_APB1H_FZ: All Peripherals Operate as in Normal Mode
        __var DbgMCU_APB2_Fz  = 0x00000000;   // DGBMCU_APB2_FZ : All Peripherals Operate as in Normal Mode
        __var DbgMCU_APB3_Fz  = 0x00000000;   // DBGMCU_APB3FZR : All Peripherals Operate as in Normal Mode
        __var DbgMCU_AHB1_Fz  = 0x00000000;   // DBGMCU_AHB1FZR : All Peripherals Operate as in Normal Mode
        __var DbgMCU_AHB3_Fz  = 0x00000000;   // DBGMCU_AHB3FZR : All Peripherals Operate as in Normal Mode
        __var TraceClk_Pin    = 0x00040002;   // PE2 (Note: PA8 uses AF12)
        __var TraceD0_Pin     = 0x00020009;   // PC9
        __var TraceD1_Pin     = 0x0002000A;   // PC10
        __var TraceD2_Pin     = 0x00040005;   // PE5
        __var TraceD3_Pin     = 0x0002000C;   // PC12
        __var DoOptionByteLoading = 0;        // Disabled
      </debugvars>

