Open-CMSIS-Pack/pack-examples/STM32U5xx_DFP/Keil.STM32U5xx_DFP.pdsc
        <!-- *************************  Device 'STM32U5F9VI'   ***************************** -->
        <device Dname="STM32U5F9VITxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5Fx_2M_0800.FLM" start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5Fx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="100"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32U5G9'  ************************************* -->
      <subFamily DsubFamily="STM32U5G9">
        <debug svd="CMSIS/SVD/STM32U5Gx.svd"/>
        <compile define="STM32U5G9xx"/>

        <book name="Documentation/DS14102.pdf" title="STM32U5Gxxx Datasheet"/>

        <memory name="SRAM12356"    access="rwx" start="0x20000000"  size="0x00270000" default="1" init="0" />
        <memory name="SRAM_GFXMM"   access="rwx" start="0x24000000"  size="0x01000000" default="0" init="0" />
        <memory name="SRAM4"        access="rwx" start="0x28000000"  size="0x00004000" default="1" init="0" />

        <!-- ################################### 4MB ################################## -->
        <!-- *************************  Device 'STM32U5G9NJ'   ************************ -->
        <device Dname="STM32U5G9NJHxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00400000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5Fx_4M_0800.FLM" start="0x08000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5Fx_4M_0C00.FLM" start="0x0C000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="BGA" n="216"/>
        </device>

        <!-- *************************  Device 'STM32U5G9BJ'   ***************************** -->
        <device Dname="STM32U5G9BJYxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00400000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5Fx_4M_0800.FLM" start="0x08000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5Fx_4M_0C00.FLM" start="0x0C000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="CSP" n="208"/>
        </device>

        <!-- *************************  Device 'STM32U5G9JJ'   ***************************** -->
        <device Dname="STM32U5G9ZJJxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00400000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5Fx_4M_0800.FLM" start="0x08000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5Fx_4M_0C00.FLM" start="0x0C000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="BGA" n="144"/>
        </device>

        <!-- *************************  Device 'STM32U5G9ZJ'   ***************************** -->
        <device Dname="STM32U5G9ZJTxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00400000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5Fx_4M_0800.FLM" start="0x08000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5Fx_4M_0C00.FLM" start="0x0C000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="144"/>
        </device>

        <!-- *************************  Device 'STM32U5G9VJ'   ***************************** -->
        <device Dname="STM32U5G9VJTxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00400000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5Fx_4M_0800.FLM" start="0x08000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5Fx_4M_0C00.FLM" start="0x0C000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="100"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32U5F7'  ************************************* -->
      <subFamily DsubFamily="STM32U5F7">
        <compile define="STM32U5F7xx"/>
        <debug svd="CMSIS/SVD/STM32U5Fx.svd"/>

        <book name="Documentation/DS14395.pdf" title="STM32U5Fxxx Datasheet"/>

        <memory name="SRAM12356"    access="rwx" start="0x20000000" size="0x00270000" default="1" init="0" />
        <memory name="SRAM_GFXMM"   access="rwx" start="0x24000000" size="0x01000000" default="1" init="0" />
        <memory name="SRAM4"        access="rwx" start="0x28000000" size="0x00004000" default="1" init="0" />

        <!-- ################################### 4MB ################################## -->
        <!-- *************************  Device 'STM32U5F7VJ'   ************************ -->
        <device Dname="STM32U5F7VJTxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00400000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5Fx_4M_0800.FLM" start="0x08000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5Fx_4M_0C00.FLM" start="0x0C000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="100"/>
        </device>
        <device Dname="STM32U5F7VJTx">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00400000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5Fx_4M_0800.FLM" start="0x08000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5Fx_4M_0C00.FLM" start="0x0C000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="100"/>
        </device>

