Open-CMSIS-Pack/pack-examples/STM32U5xx_DFP/Keil.STM32U5xx_DFP.pdsc
        <!-- ################################### 2MB ################################## -->
        <!-- *************************  Device 'STM32U5F7VI'   ************************ -->
        <device Dname="STM32U5F7VITxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5Fx_2M_0800.FLM" start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5Fx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="100"/>
        </device>
        <device Dname="STM32U5F7VITx">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5Fx_2M_0800.FLM" start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5Fx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="100"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32U5G7'   ************************************* -->
      <subFamily DsubFamily="STM32U5G7">
        <compile define="STM32U5G7xx"/>
        <debug svd="CMSIS/SVD/STM32U5Gx.svd"/>

        <book name="Documentation/DS14102.pdf" title="STM32U5Gxxx Datasheet"/>

        <memory name="SRAM12356"    access="rwx" start="0x20000000" size="0x00270000" default="1" init="0" />
        <memory name="SRAM_GFXMM"   access="rwx" start="0x24000000" size="0x01000000" default="1" init="0" />
        <memory name="SRAM4"        access="rwx" start="0x28000000" size="0x00004000" default="1" init="0" />

        <!-- ################################### 4MB ################################## -->
        <!-- *************************  Device 'STM32U5G7VJ'   ************************ -->
        <device Dname="STM32U5G7VJTxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00400000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5Fx_4M_0800.FLM" start="0x08000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5Fx_4M_0C00.FLM" start="0x0C000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="100"/>
        </device>
        <device Dname="STM32U5G7VJTx">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00400000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5Fx_4M_0800.FLM" start="0x08000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5Fx_4M_0C00.FLM" start="0x0C000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="100"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32U595'  *********************************** -->
      <subFamily DsubFamily="STM32U595">
        <compile define="STM32U595xx"/>
        <debug svd="CMSIS/SVD/STM32U595.svd"/>

        <book name="Documentation/DS13633.pdf" title="STM32U59xxx Datasheet"/>

        <memory name="SRAM1235"     access="rwx" start="0x20000000" size="0x00270000" default="1" init="0" />
        <memory name="SRAM_GFXMM"   access="rwx" start="0x24000000" size="0x01000000" default="1" init="0" />
        <memory name="SRAM4"        access="rwx" start="0x28000000" size="0x00004000" default="1" init="0" />

        <!-- ################################### 4MB ################################## -->
        <!-- *************************  Device 'STM32U595AJ'  ************************* -->
        <device Dname="STM32U595AJHx">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00400000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0800.FLM" start="0x08000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0C00.FLM" start="0x0C000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="BGA" n="169"/>
        </device>
        <device Dname="STM32U595AJHxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00400000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0800.FLM" start="0x08000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0C00.FLM" start="0x0C000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="BGA" n="169"/>
        </device>

        <!-- *************************  Device 'STM32U595ZJ'  ************************* -->
        <device Dname="STM32U595ZJTx">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00400000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0800.FLM" start="0x08000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0C00.FLM" start="0x0C000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="144"/>
        </device>
        <device Dname="STM32U595ZJTxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00400000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0800.FLM" start="0x08000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0C00.FLM" start="0x0C000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="144"/>
        </device>
