Open-CMSIS-Pack/pack-examples/STM32U5xx_DFP/Keil.STM32U5xx_DFP.pdsc
        <device Dname="STM32U5A5ZJTxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00400000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0800.FLM" start="0x08000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0C00.FLM" start="0x0C000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="144"/>
        </device>
        <device Dname="STM32U5A5ZJYxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00400000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0800.FLM" start="0x08000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0C00.FLM" start="0x0C000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="CSP" n="150"/>
        </device>

        <!-- ************************* Device 'STM32U5A5QJ' *************************** -->
        <device Dname="STM32U5A5QJIx">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00400000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0800.FLM" start="0x08000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0C00.FLM" start="0x0C000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="BGA" n="132"/>
        </device>
        <device Dname="STM32U5A5QJIxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00400000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0800.FLM" start="0x08000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0C00.FLM" start="0x0C000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="BGA" n="132"/>
        </device>

        <!-- *************************  Device 'STM32U5A5VJ'  ************************* -->
        <device Dname="STM32U5A5VJTx">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00400000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0800.FLM" start="0x08000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0C00.FLM" start="0x0C000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="100"/>
        </device>
        <device Dname="STM32U5A5VJTxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00400000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0800.FLM" start="0x08000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0C00.FLM" start="0x0C000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="100"/>
        </device>

        <!-- *************************  Device 'STM32U5A5RJ'  ************************* -->
        <device Dname="STM32U5A5RJTx">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00400000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0800.FLM" start="0x08000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0C00.FLM" start="0x0C000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="64"/>
        </device>
        <device Dname="STM32U5A5RJTxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00400000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0800.FLM" start="0x08000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0C00.FLM" start="0x0C000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="64"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32U599' DSI  ******************************* -->
      <subFamily DsubFamily="STM32U599">
        <compile define="STM32U599xx"/>
        <debug svd="CMSIS/SVD/STM32U599.svd"/>

        <book name="Documentation/DS13633.pdf" title="STM32U59xxx Datasheet"/>

        <memory name="SRAM1235"     access="rwx" start="0x20000000" size="0x00270000" default="1" init="0" />
        <memory name="SRAM_GFXMM"   access="rwx" start="0x24000000" size="0x01000000" default="1" init="0" />
        <memory name="SRAM4"        access="rwx" start="0x28000000" size="0x00004000" default="1" init="0" />

        <!-- ################################### 4MB ################################## -->
        <!-- *************************  Device 'STM32U599BJ'  ************************* -->
        <device Dname="STM32U599BJYxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00400000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0800.FLM" start="0x08000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0C00.FLM" start="0x0C000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="CSP" n="208"/>
        </device>

        <!-- *************************  Device 'STM32U599NJ'  ************************* -->
        <device Dname="STM32U599NJHxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00400000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0800.FLM" start="0x08000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0C00.FLM" start="0x0C000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="BGA" n="216"/>
        </device>

