Open-CMSIS-Pack/pack-examples/STM32U5xx_DFP/Keil.STM32U5xx_DFP.pdsc
        <!-- *************************  Device 'STM32U5A9ZJ'  ************************* -->
        <device Dname="STM32U5A9ZJTxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00400000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0800.FLM" start="0x08000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0C00.FLM" start="0x0C000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="144"/>
        </device>
        <device Dname="STM32U5A9ZJYxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00400000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0800.FLM" start="0x08000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0C00.FLM" start="0x0C000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="CSP" n="150"/>
        </device>

        <!-- *************************  Device 'STM32U5A9VJ'  ************************* -->
        <device Dname="STM32U5A9VJTxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00400000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0800.FLM" start="0x08000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U59x_4M_0C00.FLM" start="0x0C000000" size="0x00400000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="100"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32U575' non crypto  ************************ -->
      <subFamily DsubFamily="STM32U575">
        <compile define="STM32U575xx"/>
        <debug svd="CMSIS/SVD/STM32U575.svd"/>

        <book name="Documentation/DS13737.pdf" title="STM32U575xx Datasheet"/>

        <memory name="SRAM1_2" access="rwx" start="0x20000000" size="0x00040000" default="1" init="0" />
        <memory name="SRAM3"   access="rwx" start="0x20040000" size="0x00080000" default="0" init="0" />

        <!-- ################################### 2MB ################################## -->
        <!-- *************************  Device 'STM32U575ZI'  ************************* -->
        <device Dname="STM32U575ZITx">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="144"/>
        </device>
        <device Dname="STM32U575ZITxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="144"/>
        </device>

        <!-- *************************  Device 'STM32U575QI'  ************************* -->
        <device Dname="STM32U575QIIx">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="BGA" n="132"/>
        </device>
        <device Dname="STM32U575QIIxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="BGA" n="132"/>
        </device>

        <!-- *************************  Device 'STM32U575VI'  ************************* -->
        <device Dname="STM32U575VITx">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="100"/>
        </device>
        <device Dname="STM32U575VITxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="100"/>
        </device>

        <!-- *************************  Device 'STM32U575RI'  ************************* -->
        <device Dname="STM32U575RITx">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="64"/>
        </device>
        <device Dname="STM32U575RITxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="64"/>
        </device>

        <!-- *************************  Device 'STM32U575CI'  ************************* -->
        <device Dname="STM32U575CITx">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="48"/>
        </device>
