Open-CMSIS-Pack/pack-examples/STM32U5xx_DFP/Keil.STM32U5xx_DFP.pdsc
        <device Dname="STM32U575CITxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="48"/>
        </device>
        <device Dname="STM32U575CIUx">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="48"/>
        </device>
        <device Dname="STM32U575CIUxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32U575AI'  ************************* -->
        <device Dname="STM32U575AIIx">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="BGA" n="169"/>
        </device>
        <device Dname="STM32U575AIIxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="BGA" n="169"/>
        </device>

        <!-- *************************  Device 'STM32U575OI'  ************************* -->
        <device Dname="STM32U575OIYxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00200000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0800.FLM" start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_2M_0C00.FLM" start="0x0C000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="CSP" n="90"/>
        </device>

        <!-- ################################### 1MB ################################## -->
        <!-- *************************  Device 'STM32U575CG'  ************************* -->
        <device Dname="STM32U575CGUx">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00100000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_1M_0800.FLM" start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_1M_0C00.FLM" start="0x0C000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="48"/>
        </device>
        <device Dname="STM32U575CGUxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00100000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_1M_0800.FLM" start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_1M_0C00.FLM" start="0x0C000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="48"/>
        </device>
        <device Dname="STM32U575CGTx">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00100000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_1M_0800.FLM" start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_1M_0C00.FLM" start="0x0C000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="48"/>
        </device>
        <device Dname="STM32U575CGTxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00100000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_1M_0800.FLM" start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_1M_0C00.FLM" start="0x0C000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32U575RG'  ************************* -->
        <device Dname="STM32U575RGTx">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00100000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_1M_0800.FLM" start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_1M_0C00.FLM" start="0x0C000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="64"/>
        </device>
        <device Dname="STM32U575RGTxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00100000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_1M_0800.FLM" start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_1M_0C00.FLM" start="0x0C000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="64"/>
        </device>

        <!-- *************************  Device 'STM32U575VG'  ************************* -->
        <device Dname="STM32U575VGTx">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00100000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_1M_0800.FLM" start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_1M_0C00.FLM" start="0x0C000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="100"/>
        </device>
        <device Dname="STM32U575VGTxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00100000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_1M_0800.FLM" start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_1M_0C00.FLM" start="0x0C000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="100"/>
        </device>

        <!-- *************************  Device 'STM32U575ZG'  ************************* -->
        <device Dname="STM32U575ZGTx">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00100000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_1M_0800.FLM" start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_1M_0C00.FLM" start="0x0C000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="144"/>
        </device>
        <device Dname="STM32U575ZGTxQ">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00100000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_1M_0800.FLM" start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_1M_0C00.FLM" start="0x0C000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="144"/>
        </device>

        <!-- *************************  Device 'STM32U575QG'  ************************* -->
        <device Dname="STM32U575QGIx">
          <memory name="Flash"  access="rx"                   start="0x08000000" size="0x00100000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_1M_0800.FLM" start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_1M_0C00.FLM" start="0x0C000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="BGA" n="132"/>
        </device>
