Open-CMSIS-Pack/pack-examples/STM32U5xx_DFP/Keil.STM32U5xx_DFP.pdsc
        <!-- *************************  Device 'STM32U535NEYxQ'  ********************** -->
        <device Dname="STM32U535NEYxQ">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00080000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0800.FLM" start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0C00.FLM" start="0x0C000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="CSP" n="56"/>
        </device>

        <!-- *************************  Device 'STM32U535JEYxQ'  ********************** -->
        <device Dname="STM32U535JEYxQ">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00080000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0800.FLM" start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0C00.FLM" start="0x0C000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="CSP" n="72"/>
        </device>

        <!-- ################################## 256KB ################################# -->
        <!-- *************************  Device 'STM32U535CC'  ************************* -->
        <device Dname="STM32U535CCTx">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_256K_0800.FLM" start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_256K_0C00.FLM" start="0x0C000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="48"/>
        </device>
        <device Dname="STM32U535CCTxQ">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_256K_0800.FLM" start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_256K_0C00.FLM" start="0x0C000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="48"/>
        </device>

        <device Dname="STM32U535CCUx">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_256K_0800.FLM" start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_256K_0C00.FLM" start="0x0C000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="48"/>
        </device>
        <device Dname="STM32U535CCUxQ">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_256K_0800.FLM" start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_256K_0C00.FLM" start="0x0C000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32U535RC'  ************************* -->
        <device Dname="STM32U535RCTx">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_256K_0800.FLM" start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_256K_0C00.FLM" start="0x0C000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="64"/>
        </device>
        <device Dname="STM32U535RCTxQ">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_256K_0800.FLM" start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_256K_0C00.FLM" start="0x0C000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="64"/>
        </device>
        <device Dname="STM32U535RCIx">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_256K_0800.FLM" start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_256K_0C00.FLM" start="0x0C000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="BGA" n="64"/>
        </device>
        <device Dname="STM32U535RCIxQ">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_256K_0800.FLM" start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_256K_0C00.FLM" start="0x0C000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="BGA" n="64"/>
        </device>

        <!-- *************************  Device 'STM32U535VC'  ************************* -->
        <device Dname="STM32U535VCTx">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_256K_0800.FLM" start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_256K_0C00.FLM" start="0x0C000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="100"/>
        </device>
        <device Dname="STM32U535VCTxQ">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_256K_0800.FLM" start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_256K_0C00.FLM" start="0x0C000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="100"/>
        </device>

        <device Dname="STM32U535VCIx">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_256K_0800.FLM" start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_256K_0C00.FLM" start="0x0C000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="BGA" n="100"/>
        </device>
