Open-CMSIS-Pack/pack-examples/STM32U5xx_DFP/Keil.STM32U5xx_DFP.pdsc
        <device Dname="STM32U535VCIxQ">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00040000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_256K_0800.FLM" start="0x08000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_256K_0C00.FLM" start="0x0C000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="BGA" n="100"/>
        </device>

        <!-- *************************  Device 'STM32U535NCYxQ'  ********************** -->
        <device Dname="STM32U535NCYxQ">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00080000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_256K_0800.FLM" start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_256K_0C00.FLM" start="0x0C000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="CSP" n="56"/>
        </device>

        <!-- ################################## 128KB ################################# -->
        <!-- *************************  Device 'STM32U535CB'  ************************* -->
        <device Dname="STM32U535CBTx">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00020000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_128K_0800.FLM" start="0x08000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_128K_0C00.FLM" start="0x0C000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="48"/>
        </device>
        <device Dname="STM32U535CBTxQ">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00020000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_128K_0800.FLM" start="0x08000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_128K_0C00.FLM" start="0x0C000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="48"/>
        </device>

        <device Dname="STM32U535CBUx">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00020000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_128K_0800.FLM" start="0x08000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_128K_0C00.FLM" start="0x0C000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="48"/>
        </device>
        <device Dname="STM32U535CBUxQ">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00020000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_128K_0800.FLM" start="0x08000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_128K_0C00.FLM" start="0x0C000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32U535RB'  ************************* -->
        <device Dname="STM32U535RBTx">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00020000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_128K_0800.FLM" start="0x08000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_128K_0C00.FLM" start="0x0C000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="64"/>
        </device>
        <device Dname="STM32U535RBTxQ">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00020000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_128K_0800.FLM" start="0x08000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_128K_0C00.FLM" start="0x0C000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="64"/>
        </device>
        <device Dname="STM32U535RBIx">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00020000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_128K_0800.FLM" start="0x08000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_128K_0C00.FLM" start="0x0C000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="BGA" n="64"/>
        </device>
        <device Dname="STM32U535RBIxQ">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00020000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_128K_0800.FLM" start="0x08000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_128K_0C00.FLM" start="0x0C000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="BGA" n="64"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32U545' crypto  **************************** -->
      <subFamily DsubFamily="STM32U545">
        <compile define="STM32U545xx"/>
        <debug svd="CMSIS/SVD/STM32U545.svd"/>

        <book name="Documentation/DS14216.pdf" title="STM32U545xx Datasheet"/>

        <memory name="SRAM1_2" access="rwx" start="0x20000000" size="0x00040000" default="1" init="0" />
        <memory name="SRAM3"   access="rwx" start="0x28000000" size="0x00004000" default="0" init="0" />

        <!-- ################################## 512 KB ################################ -->
        <!-- *************************  Device 'STM32U545CE'  ************************* -->
        <device Dname="STM32U545CETx">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00080000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0800.FLM" start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0C00.FLM" start="0x0C000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="48"/>
        </device>
        <device Dname="STM32U545CETxQ">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00080000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0800.FLM" start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0C00.FLM" start="0x0C000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="48"/>
        </device>
        <device Dname="STM32U545CEUx">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00080000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0800.FLM" start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0C00.FLM" start="0x0C000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="48"/>
        </device>
        <device Dname="STM32U545CEUxQ">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00080000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0800.FLM" start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0C00.FLM" start="0x0C000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32U545RE'  ************************* -->
        <device Dname="STM32U545RETx">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00080000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0800.FLM" start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0C00.FLM" start="0x0C000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="64"/>
        </device>
