Open-CMSIS-Pack/pack-examples/STM32U5xx_DFP/Keil.STM32U5xx_DFP.pdsc
        <device Dname="STM32U545RETxQ">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00080000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0800.FLM" start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0C00.FLM" start="0x0C000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="64"/>
        </device>
        <device Dname="STM32U545REIx">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00080000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0800.FLM" start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0C00.FLM" start="0x0C000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="BGA" n="64"/>
        </device>
        <device Dname="STM32U545REIxQ">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00080000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0800.FLM" start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0C00.FLM" start="0x0C000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="BGA" n="64"/>
        </device>

        <!-- *************************  Device 'STM32U545VE'  ************************* -->
        <device Dname="STM32U545VETx">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00080000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0800.FLM" start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0C00.FLM" start="0x0C000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="100"/>
        </device>
        <device Dname="STM32U545VETxQ">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00080000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0800.FLM" start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0C00.FLM" start="0x0C000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="QFP" n="100"/>
        </device>
        <device Dname="STM32U545VEIx">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00080000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0800.FLM" start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0C00.FLM" start="0x0C000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="BGA" n="100"/>
        </device>
        <device Dname="STM32U545VEIxQ">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00080000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0800.FLM" start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0C00.FLM" start="0x0C000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="BGA" n="100"/>
        </device>

        <!-- *************************  Device 'STM32U545NEYxQ'  ********************** -->
        <device Dname="STM32U545NEYxQ">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00080000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0800.FLM" start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0C00.FLM" start="0x0C000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="CSP" n="56"/>
        </device>

        <!-- *************************  Device 'STM32U545JEYxQ'  ********************** -->
        <device Dname="STM32U545JEYxQ">
          <memory name="Flash"  access="rx"                     start="0x08000000" size="0x00080000" default="1" startup="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0800.FLM" start="0x08000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <algorithm name="CMSIS/Flash/STM32U5xx_512K_0C00.FLM" start="0x0C000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
          <feature type="CSP" n="72"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Device Conditions -->
    <condition id="STM32U5">
      <description>STMicroelectronics STM32U5 Devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32U5*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="STM32U5 CMSIS">
      <description>STMicroelectronics STM32U5 Device and CMSIS-CORE</description>
      <require condition="STM32U5"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- CMSIS Driver Conditions -->
    <condition id="STM32U5 CMSIS CubeMX">
      <description>Requirement for CMSIS Driver</description>
      <require condition="STM32U5 CMSIS"/>
      <require Cclass="Device" Cgroup="CubeMX"/>
    </condition>

  </conditions>

  <components>
    <!-- CubeMX Generator -->
    <component generator="CubeMX" Cclass="Device" Cgroup="CubeMX" Cversion="1.0.0" condition="STM32U5 CMSIS">
      <description>Configuration via STM32CubeMX</description>
      <RTE_Components_h>
        #define RTE_DEVICE_CUBE_MX
        #define CMSIS_device_header "stm32u5xx.h"
      </RTE_Components_h>
      <files>
        <file category="doc" name="https://github.com/Open-CMSIS-Pack/cmsis-toolbox/tree/main/docs/CubeMX.md"/>
      </files>
    </component>

    <!-- CMSIS drivers -->
    <!-- Note:
           The following drivers will be removed and be superseded by generic 
           drivers based on STMicroelectronics HAL provided in a separate pack.
    -->
    <component Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.2.0" Cversion="1.1.0" condition="STM32U5 CMSIS CubeMX">
      <description>I2C Driver for STM32U5 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_I2C1                /* Driver I2C1 */
        #define RTE_Drivers_I2C2                /* Driver I2C2 */
        #define RTE_Drivers_I2C3                /* Driver I2C3 */
        #define RTE_Drivers_I2C4                /* Driver I2C4 */
        #define RTE_Drivers_I2C5                /* Driver I2C5 */
        #define RTE_Drivers_I2C6                /* Driver I2C6 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/I2C_STM32U5xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="MCI" Capiversion="2.2.0" Cversion="1.0.0" condition="STM32U5 CMSIS CubeMX">
      <description>MCI Driver for STM32U5 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_MCI0                /* Driver MCI0 */
        #define RTE_Drivers_MCI1                /* Driver MCI1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/MCI_STM32U5xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.1.0" Cversion="1.1.0" condition="STM32U5 CMSIS CubeMX">
      <description>SPI Driver for STM32U5 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_SPI1                /* Driver SPI1 */
        #define RTE_Drivers_SPI2                /* Driver SPI2 */
        #define RTE_Drivers_SPI3                /* Driver SPI3 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/SPI_STM32U5xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.1.0" Cversion="1.2.0" condition="STM32U5 CMSIS CubeMX">
      <description>USART Driver for STM32U5 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_USART1              /* Driver USART1 */
        #define RTE_Drivers_USART2              /* Driver USART2 */
        #define RTE_Drivers_USART3              /* Driver USART3 */
        #define RTE_Drivers_USART4              /* Driver USART4 */
        #define RTE_Drivers_USART5              /* Driver USART5 */
        #define RTE_Drivers_USART6              /* Driver USART6 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/UART_STM32U5xx.c"/>
        <file category="source" name="CMSIS/Driver/USART_STM32U5xx.c"/>
        <file category="source" name="CMSIS/Driver/IrDA_STM32U5xx.c"/>
        <file category="source" name="CMSIS/Driver/SmartCard_STM32U5xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Device" Csub="Full-speed" Capiversion="2.3.0" Cversion="1.1.0" condition="STM32U5 CMSIS CubeMX">
      <description>USB Device Full-Speed Driver (OTG) for STM32U5 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/OTG_STM32U5xx.c"/>
        <file category="source" name="CMSIS/Driver/USBD_OTG_STM32U5xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Host" Csub="Full-speed" Capiversion="2.3.0" Cversion="1.1.0" condition="STM32U5 CMSIS CubeMX">
      <description>USB Host Full-Speed Driver (OTG) for STM32U5 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_USBH0               /* Driver USBH0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/OTG_STM32U5xx.c"/>
        <file category="source" name="CMSIS/Driver/USBH_OTG_STM32U5xx.c"/>
      </files>
    </component>
  </components>
</package>
